--- Lua 스크립트 암호화
function get_module_name()
             return "random_respawn"
end 

-- 모든 아이디는 0이 아닐 때만 수행됨

--function set_random_respawn( random_respawn_id, interval, random_area_id, inc, is_wandering, way_point_id, prespawn_count, except_raid_siege )

--random_respawn_id : 랜덤 리스폰의 고유 아이디
--interval : 1/100초 단위. 1초는 100, 1분은 6000
--random_area_id : 랜덤 리젠될 위치 아이디
--inc : 매 체크시 증가시킬 몹 갯수
--is_wandering: 배회 여부
--way_point_id : 로밍 아이디 ( 테스트 필요 )
--prespawn_count : 월드에 미리 등장시켜둘 몬스터 수, 랜덤 리젠의 경우 처음 등장한 몬스터의 수를 항상 유지한다.
--except_raid_siege : 레이드, 시즈 제외 ( 1 : 제외, 0 : 제외아님 )

--function add_random_area( random_area_id, left, top, right, bottom )

--random_area_id : 랜덤 리젠될 위치 아이디
--left : 좌
--top : 상
--right : 우
--bottom : 하


--function add_random_monster( random_respawn_id, monster_id, ratio )

--random_respawn_id : 랜덤 리스폰의 고유 아이디
--monster_id : 몬스터 아이디
--ratio : 해당 몬스터가 등장할 확률


function random_respawn()
	----랜덤 리젠 위치 세팅

		--아래와 같이 세팅 시
		--set_random_respawn의 random_area_id에 0을 넣었을 경우 아래 7개 박스 중 하나가 선택되며 그 박스 안에서 리젠이 된다.

		--add_random_area( 1, 1000, 1000, 2000, 2000 )		-- 1의 첫번째
		--add_random_area( 1, 1500, 1500, 2500, 2500 )		-- 1의 두번째
		--add_random_area( 1, 2000, 2000, 3000, 3000 )		-- 1의 세번째
		--add_random_area( 1, 2500, 2500, 3500, 3500 )		-- 1의 네번째
		--add_random_area( 1, 3000, 3000, 4000, 4000 )		-- 1의 다섯번째
		--add_random_area( 1, 3500, 3500, 4500, 4500 )		-- 1의 여섯번째
		--add_random_area( 1, 4000, 4000, 5000, 5000 )		-- 1의 일곱번째

		--add_random_area( 2, 1000, 1000, 2000, 2000 )		-- 2의 첫번째
		--add_random_area( 2, 1500, 1500, 2500, 2500 )		-- 2의 두번째
		--add_random_area( 2, 2000, 2000, 3000, 3000 )		-- 2의 세번째

		--add_random_area( 3, 2500, 2500, 3500, 3500 )		-- 3의 첫번째
		--add_random_area( 3, 3000, 3000, 4000, 4000 )		-- 3의 두번째

	----실제 랜덤 리스폰 정보 세팅

		--아래와 같이 세팅 시 0번 랜덤 리스폰은 위에서 세팅한 1번 지역(3개) 중에 1/3 확률로 한 지역이 결정이 되어 리젠이 된다.
		--하지만 해당 리스폰 정보에 몬스터를 지정하지 않았으므로 리스폰 몬스터가 없다.

		--set_random_respawn( 1, 6000, 1, 0, 1, 0, 100 )

	----몬스터 정보 세팅
		--아래와 같이 세팅 시 0번 랜덤 리스폰 정보에 따라 1000, 2000, 3000번 몬스터가 각각 30% 확률로 리젠된다.
		--리스폰될 확률의 합계가 100%가 되지 않더라도 결국엔 리스폰 수에 맞게 리젠될 것이며
		--100%를 넘을 경우 100% 이후의 몬스터는 무시된다 ∵5000번 몬스터는 절대 리젠되지 않음
		--add_random_monster( 1, 1000, 100000000 )
		--add_random_monster( 1, 2000, 100000000 )
		--add_random_monster( 1, 3000, 100000000 )
		--add_random_monster( 1, 4000, 10000000 )
		--add_random_monster( 1, 5000, 100000000 )

	--set_random_respawn( 1, 100, 1, 1, 1, 0, 5 )

	--add_random_area( 1, 219248, 57246, 219481, 57446 )	-- 마르두카 //워프 219386	57060
	--add_random_area( 1, 218978, 56964, 219249, 57170 )	-- 가이드 옆
	--add_random_area( 1, 219249, 56724, 219495, 57170 )	-- 웅담이
	--add_random_area( 1, 6600, 7046, 6601, 7047 )	-- 부여석 왼쪽
	--add_random_area( 1, 6552, 6941, 6653, 6942 )	-- 텔레포터 오른쪽
	--add_random_area( 1, 6469, 6878, 6470, 6879 )	-- 마켓 안내인

	--add_random_monster( 1, 10070016 , 100000000 )	-- 카벙클
	--add_random_monster( 1, 19, 100000000 )		-- 화이트울프
	--add_random_monster( 1, 55, 100000000 )		-- 기린
	--add_random_monster( 1, 103, 10000000 )		-- 지니
	--add_random_monster( 1, 10070016 , 10000000 )	-- 카벙클

	local state_code = get_local_info()  -- 국가코드
	local current_time = get_os_date( "%Y-%m-%d %H:%M:%S" ) -- 현재 시간
		
--수정계곡 1
	set_random_respawn( 1, 60000, 1, 1, 1, 0, 1, 1 ) --240000(40분)

	add_random_area( 1, 218495, 59094, 218852, 59430 ) ---검은 복수자
	add_random_area( 1, 220303,	63086	,220723,	63435)  --크리스탈 그라인더
	add_random_area( 1, 224615,	61172	,224953,	61512)
	add_random_area( 1, 222423	,59335	,222753,	59731)
	add_random_area( 1, 224084	,56787	,224988,	57695)
	add_random_area( 1, 222083	,56712	,222773,	57034)
	add_random_area( 1, 221512	,61994	,222780,	62506)

	add_random_monster( 1, 10070016 , 100000000 )	-- 카벙클


--수정계곡 2
	set_random_respawn( 2, 60000, 2, 1, 1, 0, 1, 1 ) --240000(40분)

	add_random_area( 2, 218512,	91371	,218898,	91712)
	add_random_area( 2, 220720	,95711	,220744,	95714)
	add_random_area( 2, 224564,	93511	,225028,	93803)
	add_random_area( 2, 222386	,91645	,222759,	92020)
	add_random_area( 2, 221469,	94270,	222900,	94756)
	add_random_area( 2, 224078	,89042,	225018,	89968)
	add_random_area( 2, 222036	,88922,	222864,	89290)

	add_random_monster( 2, 10070016 , 100000000 )	-- 카벙클


--팔미르 1
	set_random_respawn( 3, 60000, 3, 1, 1, 0, 1, 1 ) --240000(40분)

	add_random_area( 3, 220066,	140525,	220634,	141095)
	add_random_area( 3, 222541,	142738,	223121,	143264)
	add_random_area( 3, 224481,	139406,	225014,	139837)
	add_random_area( 3, 217259,	136375,	218612,	137516)
	add_random_area( 3, 221210,	131856,	221655,	132303)
	add_random_area( 3, 214824,	130345,	215353,	130946 )--
	add_random_area( 3, 211615,	132682,	212322,	133203)
	add_random_area( 3, 211523,	138163,	212154,	138698)
	add_random_area( 3, 216281,	141877,	216767,	142369)

	add_random_monster( 3, 10090023 , 100000000 )	-- 카벙클


--팔미르 2
	set_random_respawn( 4, 60000, 4, 1, 1, 0, 1, 1 ) --240000(40분)

	add_random_area( 4, 216265,	158011,	216777,	158497)
	add_random_area( 4, 220058,	156716,	220580,	157175)
	add_random_area( 4, 222643,	158830,	223141,	159284)
	add_random_area( 4, 224509,	155533,	225030,	155945)
	add_random_area( 4, 221125,	148029,	221671,	148404)
	add_random_area( 4, 214778,	146492,	215353,	147073)
	add_random_area( 4, 211642,	148804,	212308,	149332)
	add_random_area( 4, 211525,	154303,	212124,	154818)
	add_random_area( 4, 217274,	152563,	218882,	153942)

	add_random_monster( 4, 10090023 , 100000000 )	-- 카벙클

--엘 카시아
	--맵툴 상에서 오른쪽 부터 왼쪽으로
	set_random_respawn( 5, 60000, 5, 1, 1, 0, 1, 1 ) --240000(40분)

	add_random_area( 5, 207244,	120007,	207578,	120202)
	add_random_area( 5, 207572,	118618, 207891, 118811)
	add_random_area( 5, 207285, 117191, 207620, 117468)
	add_random_area( 5, 205110, 116429, 205455, 116550)
	add_random_area( 5, 204398, 117678, 204696, 117944)
	add_random_area( 5, 204226, 118944, 204496, 119187)
	--가운데 크게~
	add_random_area( 5, 205827,	117432,	206379,	120303)

	add_random_monster( 5, 10125009 , 100000000 )	-- 카벙클
	--add_random_monster( 5, 22000077, 100000000 )	-- 눈사람 카벙클(이벤트용)


--백룡
	set_random_respawn( 6, 60000, 6, 1, 1, 0, 1, 1 ) --240000(40분)

	--시작
	add_random_area( 6, 201266,	167859,	201601,	168020)
	--오른쪽
	--add_random_area( 6, 202177,	168735,	202488,	169299)
	--add_random_area( 6, 202125,	169936,	202441,	170394)
	--가운데
	--add_random_area( 6, 201274,	169822,	201459,	170033)
	add_random_area( 6, 201154,	170785,	201674,	171011)
	add_random_area( 6, 201068,	171944,	201767,	172386)
	add_random_area( 6, 200060,	172028,	200367, 172300)
	add_random_area( 6, 199574,	171071,	199856,	171309)
	add_random_area( 6, 199996,	170012,	200372,	170226)
	--add_random_area( 6, 200159,	168268,	200580,	168972)

	add_random_monster( 6, 10146009 , 100000000 )	-- 카벙클
	--add_random_monster( 6, 22000078, 100000000 )	-- 눈사람 카벙클(이벤트용)


--흑룡
	set_random_respawn( 7, 60000, 7, 1, 1, 0, 1, 1 ) --240000(40분)

	--오른쪽
	--add_random_area( 7, 202187	,152606	,202476	,153152)
	--add_random_area( 7, 202135,	153805,	202398,	154255)
	add_random_area( 7, 202079,	154977,	202400,	155081)
	add_random_area( 7, 202306,	155476,	202629,	155574)
	--중앙
	add_random_area( 7, 201117, 154622, 201664, 154846)
	add_random_area( 7, 201025, 155779, 201674, 156244)
	add_random_area( 7, 200090, 155906, 200353, 156157)
	add_random_area( 7, 199574, 154935, 199853, 155171)
	add_random_area( 7, 199983, 153901, 200330, 154076)
	--add_random_area( 7, 200154,152096,200611,152859)

	add_random_monster( 7, 10158006 , 100000000 )	-- 카벙클
	--add_random_monster( 7, 22000079, 100000000 )	-- 눈사람 카벙클(이벤트용)

	
--사룡
	set_random_respawn( 8, 60000, 8, 1, 1, 0, 1, 1 ) --240000(40분)

	--오른쪽
	--add_random_area( 8, 202167,136480,	202472	,136986)
	--add_random_area( 8, 202113,137622,	202603	,138086)
	add_random_area( 8, 202279, 138953,	202394, 139853)
	--중앙
	add_random_area( 8, 201105, 138501,	201674, 138741)
	add_random_area( 8, 201030, 139671,	201695, 140134)
	add_random_area( 8, 200075, 139778,	200351, 140000)
	add_random_area( 8, 199571, 138800,	199836, 139061)
	add_random_area( 8, 200001, 137790,	200325, 137978)
	--add_random_area( 8, 200147,135973,	200628	,136722)

	add_random_monster( 8, 10165006 , 100000000 )	-- 카벙클
	--add_random_monster( 8, 22000080, 100000000 )	-- 눈사람 카벙클(이벤트용)

	
--필드보스 바포메트
	set_random_respawn( 9, 360000, 9, 1, 1, 0, 1, 1 ) --360000(60분)
	--팔미르 유적지
	add_random_area( 9, 140760, 125821,	140955, 126009)
	add_random_area( 9, 140764, 124679,	140991, 124895)
	add_random_area( 9, 139230, 124201,	139457, 124420)
	add_random_area( 9, 140377, 123459,	140525, 123635)
	add_random_area( 9, 139230, 125547,	139431, 125710)
	
	add_random_monster( 9, 300001, 100000000 )		--바포메트
	
	
--필드보스 바포메트 추종자1(중앙)
	set_random_respawn( 10, 60000, 10, 1, 0, 0, 1, 1 ) --60000(1분)
	--팔미르 유적지
	add_random_area( 10, 140944,124848,	140945	,124849)
	
	add_random_monster( 10, 81013 , 100000000 )	
	
--필드보스 바포메트 추종자2(중앙)
	set_random_respawn( 11, 60000, 11, 1, 0, 0, 1, 1 ) --60000(1분)
	--팔미르 유적지
	add_random_area( 11, 140781,124776,	140782	,124777)
	
	add_random_monster( 11, 81013 , 100000000 )		
	
--필드보스 바포메트 추종자3(중앙)
	set_random_respawn( 12, 60000, 12, 1, 0, 0, 1, 1 ) --60000(1분)
	--팔미르 유적지
	add_random_area( 12, 140934,124676,	140935	,124677)
	
	add_random_monster( 12, 81013 , 100000000 )		

--필드보스 바포메트 추종자1(중앙에서 서쪽을 바라본 상태 기준, 좌 상단)
	set_random_respawn( 13, 60000, 13, 1, 0, 0, 1, 1 ) --60000(1분)
	--팔미르 유적지
	add_random_area( 13, 139303,124405,	139304	,124406)
	
	add_random_monster( 13, 81013 , 100000000 )		
	
--필드보스 바포메트 추종자2(중앙에서 서쪽을 바라본 상태 기준, 좌 상단)
	set_random_respawn( 14, 60000, 14, 1, 0, 0, 1, 1 ) --60000(1분)
	--팔미르 유적지
	add_random_area( 14, 139249,124240,	139250	,124241)
	
	add_random_monster( 14, 81013 , 100000000 )		
	
--필드보스 바포메트 추종자3(중앙에서 서쪽을 바라본 상태 기준, 좌 상단)
	set_random_respawn( 15, 60000, 15, 1, 0, 0, 1, 1 ) --60000(1분)
	--팔미르 유적지
	add_random_area( 15, 139427,124281,	139428	,124282)
	
	add_random_monster( 15, 81013 , 100000000 )		
	
--필드보스 바포메트 추종자1(중앙에서 서쪽을 바라본 상태 기준, 좌 하단)
	set_random_respawn( 16, 60000, 16, 1, 0, 0, 1, 1 ) --60000(1분)
	--팔미르 유적지
	add_random_area( 16, 140473,123432,	140474	,123433)
	
	add_random_monster( 16, 81013 , 100000000 )		
	
--필드보스 바포메트 추종자2(중앙에서 서쪽을 바라본 상태 기준, 좌 하단)
	set_random_respawn( 17, 60000, 17, 1, 0, 0, 1, 1 ) --60000(1분)
	--팔미르 유적지
	add_random_area( 17, 140508,123603,	140509	,123604)
	
	add_random_monster( 17, 81013 , 100000000 )		
	
--필드보스 바포메트 추종자3(중앙에서 서쪽을 바라본 상태 기준, 좌 하단)
	set_random_respawn( 18, 60000, 18, 1, 0, 0, 1, 1 ) --60000(1분)
	--팔미르 유적지
	add_random_area( 18, 140337,123553,	140338	,123554)
	
	add_random_monster( 18, 81013 , 100000000 )		

--필드보스 바포메트 추종자1(중앙에서 서쪽을 바라본 상태 기준, 우 상단)
	set_random_respawn( 19, 60000, 19, 1, 0, 0, 1, 1 ) --60000(1분)
	--팔미르 유적지
	add_random_area( 19, 139341,125543,	139342	,125544)
	
	add_random_monster( 19, 81013 , 100000000 )		
	
--필드보스 바포메트 추종자2(중앙에서 서쪽을 바라본 상태 기준, 우 상단)
	set_random_respawn( 20, 60000, 20, 1, 0, 0, 1, 1 ) --60000(1분)
	--팔미르 유적지
	add_random_area( 20, 139255,125693,	139256	,125694)
	
	add_random_monster( 20, 81013 , 100000000 )		
	
--필드보스 바포메트 추종자3(중앙에서 서쪽을 바라본 상태 기준, 우 상단)
	set_random_respawn( 21, 60000, 21, 1, 0, 0, 1, 1 ) --60000(1분)
	--팔미르 유적지
	add_random_area( 21, 139433,125700,	139434	,125701)
	
	add_random_monster( 21, 81013 , 100000000 )		

--필드보스 바포메트 추종자1(중앙에서 서쪽을 바라본 상태 기준, 우 하단)
	set_random_respawn( 22, 60000, 22, 1, 0, 0, 1, 1 ) --60000(1분)
	--팔미르 유적지
	add_random_area( 22, 140956,125881,	140957	,125882)
	
	add_random_monster( 22, 81013 , 100000000 )		
	
--필드보스 바포메트 추종자2(중앙에서 서쪽을 바라본 상태 기준, 우 하단)
	set_random_respawn( 23, 60000, 23, 1, 0, 0, 1, 1 ) --60000(1분)
	--팔미르 유적지
	add_random_area( 23, 140823,126006,	140824	,126007)
	
	add_random_monster( 23, 81013 , 100000000 )		
	
--필드보스 바포메트 추종자3(중앙에서 서쪽을 바라본 상태 기준, 우 하단)
	set_random_respawn( 24, 60000, 24, 1, 0, 0, 1, 1 ) --60000(1분)
	--팔미르 유적지
	add_random_area( 24, 140772,125841,	140773	,125842)
	
	add_random_monster( 24, 81013 , 100000000 )		

--필드보스 미노타우르스
	set_random_respawn( 25, 360000, 25, 1, 1, 0, 1, 1 ) --360000(60분)
	--단절의 장벽_미궁
	add_random_area( 25, 108138,91465,	108169	,91752)
	
	add_random_monster( 25, 300004 , 100000000 )		--미노타우르스

--팔미르 유적지 캠핑장 몹1
	set_random_respawn( 26, 180000, 26, 1, 0, 0, 1, 1 ) --180000(3분)
	--단절의 장벽_미궁
	add_random_area( 26, 138680,124165,	138681	,124166)
	
	add_random_monster( 26, 85013 , 100000000 )		

--팔미르 유적지 캠핑장 몹2
	set_random_respawn( 27, 180000, 27, 1, 0, 0, 1, 1 ) --180000(3분)
	--단절의 장벽_미궁
	add_random_area( 27, 138759,124147,	138760	,124148)
	
	add_random_monster( 27, 85013 , 100000000 )		

--팔미르 유적지 캠핑장 몹3
	set_random_respawn( 28, 180000, 28, 1, 0, 0, 1, 1 ) --180000(3분)
	--단절의 장벽_미궁
	add_random_area( 28, 138691,124190,	138692	,124190)
	
	add_random_monster( 28, 85013 , 100000000 )		

--팔미르 유적지 캠핑장 몹4
	set_random_respawn( 29, 300000, 29, 1, 0, 0, 1, 1 ) --300000(5분)
	--단절의 장벽_미궁
	add_random_area( 29, 138648,124203,	138649	,124204)
	
	add_random_monster( 29, 85013 , 100000000 )		

--팔미르 유적지 캠핑장 몹5
	set_random_respawn( 30, 300000, 30, 1, 0, 0, 1, 1 ) --300000(5분)
	--단절의 장벽_미궁
	add_random_area( 30, 138710,124222,	138711	,124223)
	
	add_random_monster( 30, 85013 , 100000000 )		

--팔미르 유적지 캠핑장 몹6
	set_random_respawn( 31, 300000, 31, 1, 0, 0, 1, 1 ) --300000(5분)
	--단절의 장벽_미궁
	add_random_area( 31, 138611,124284,	138612	,124285)
	
	add_random_monster( 31, 85013 , 100000000 )		
	
--팔미르 유적지 캠핑장 몹7
	set_random_respawn( 32, 300000, 32, 1, 0, 0, 1, 1 ) --300000(5분)
	--단절의 장벽_미궁
	add_random_area( 32, 138744,124249,	138745	,124250)
	
	add_random_monster( 32, 85013 , 100000000 )		


	
--===================================2012년 12월 크리스마스 이벤트용 렌덤 리스폰==============================
--============================================================================================================
--[[
--호라이즌 외로운 루돌프
	set_random_respawn( 33, 360000, 33, 1, 0, 0, 1, 1 ) --360000(60분)
	--호라이즌 대련장 중앙
	add_random_area( 33, 150896, 79642, 150928, 79656)
	add_random_monster( 33, 1100050 , 100000000 )		--외로운 루돌프

--라크시 외로운 루돌프
	set_random_respawn( 34, 360000, 34, 1, 0, 0, 1, 1 ) --360000(60분)
	--라크시 대련장 중앙
	add_random_area( 34, 121813, 140576, 121842, 140592)
	add_random_monster( 34, 1100051 , 100000000 )			--외로운 루돌프

--카탄 외로운 루돌프
	set_random_respawn( 35, 360000, 35, 1, 1, 0, 1, 1 ) --360000(60분)
	--카탄 대련장 중앙
	add_random_area( 35, 121083, 58691, 121114, 58693)  --작은 x값, 작은 y값, 큰 x값, 큰 y값 
	add_random_monster( 35, 1100052 , 100000000 )			--외로운 루돌프

--론도 외로운 루돌프
	set_random_respawn( 36, 360000, 36, 1, 0, 0, 1, 1 ) --360000(60분)
	--론도 대련장 중앙
	add_random_area( 36, 134447, 110595, 134485, 110630)
	add_random_monster( 36, 1100053 , 100000000 )			--외로운 루돌프]]



	
--==============================================================================================================	
--==============================================================================================================	

--[[==============================================================================================================	
--==============================================================================================================	

--===================================2013년 플루토 이벤트용 렌덤 리스폰=========================================
--============================================================================================================

--호라이즌 
	set_random_respawn( 37, 360000, 37, 1, 0, 0, 1, 1 ) --360000(60분)

	add_random_area( 37, 150896, 79642, 150928, 79656)
	add_random_monster( 37, 1100057 , 100000000 )		--외로운 루돌프

--라크시 
	set_random_respawn( 38, 360000, 38, 1, 0, 0, 1, 1 ) --360000(60분)
	
	add_random_area( 38, 121813, 140576, 121842, 140592)
	add_random_monster( 38, 1100056 , 100000000 )			--외로운 루돌프

--카탄 
	set_random_respawn( 39, 360000, 39, 1, 1, 0, 1, 1 ) --360000(60분)

	add_random_area( 39, 121083, 58691, 121114, 58693)  --작은 x값, 작은 y값, 큰 x값, 큰 y값 
	add_random_monster( 39, 1100055 , 100000000 )			--외로운 루돌프

--론도 
	set_random_respawn( 40, 360000, 40, 1, 0, 0, 1, 1 ) --360000(60분)
	--론도 대련장 중앙
	add_random_area( 40, 134447, 110595, 134485, 110630)
	add_random_monster( 40, 1100054 , 100000000 )			--외로운 루돌프


	
--==============================================================================================================	
--==============================================================================================================]]	
--============================================================================================================	
--==========================2014년 크리스마스 이벤트 필드용 눈사람 랜덤 리스폰================================
--============================================================================================================
	
	
	
	local check = 0
	
	-- 한국 이벤트 (14년 12월 18일 ~ 14년 12월 31일, 실제 등장 시간은 1일 0시 전까지)
	if state_code == 1 and '2014-12-18 09:00:00' <= current_time and current_time < '2014-12-31 23:59:59' then
		check = 1
	
	-- 일본 이벤트 (14년 12월 22일 ~ 15년 1월 6일, 실제 등장 시간은 7일 0시 전까지)
	elseif state_code == 16 and '2014-12-22 11:00:00' <= current_time and current_time < '2015-01-06 23:59:59' then
		check = 1 
	
	-- 러시아 이벤트 (14년 12월 22일 ~ 15년 1월 12일, 실제 등장 시간은 13일 0시 전까지)
	elseif state_code == 256 and '2014-12-22 08:00:00' <= current_time and current_time < '2015-01-12 23:59:59' then
		check = 1 
		
	-- 미국 유럽 이벤트 (14년 12월 16일 ~ 14년 12월 30일, 실제 등장 시간은 31일 0시 전까지)
	elseif ( state_code == 4 or state_code == 8 or state_code == 128 or state_code == 16384 or state_code == 32768 or state_code == 65536 )
		and '2014-12-16 07:00:00' <= current_time and current_time < '2014-12-30 23:59:59' then
		check = 1
		
	-- 동남아 이벤트 (14년 12월 19일 ~ 15년 01월 02일, 실제 등장 시간은 3일 0시 전까지)
	elseif state_code == 512 and '2014-12-19 11:00:00' <= current_time and current_time < '2015-01-02 23:59:59' then
		check = 1 
		
	-- 중동 이벤트 (15년 1월 13일 ~ 15년 1월 27일, 실제 등장 시간은 28일 0시 전까지)
	elseif state_code == 8192 and '2015-01-13 08:00:00' <= current_time and current_time < '2015-01-27 23:59:59' then
		check = 1
	end
	
	
	if check == 1 then	

	-- 호라이즌 
		set_random_respawn( 80, 60000, 80, 1, 1, 0, 1, 1 ) --60000(10분)

		add_random_area( 80, 150896, 79642, 150928, 79656 )
		add_random_monster( 80, 22000076 , 100000000 )		-- 악몽의 눈사람

	-- 라크시 
		set_random_respawn( 81, 60000, 81, 1, 1, 0, 1, 1 ) --60000(10분)
		
		add_random_area( 81, 121813, 140576, 121842, 140592 )
		add_random_monster( 81, 22000076 , 100000000 )			-- 악몽의 눈사람

	-- 카탄 
		set_random_respawn( 82, 60000, 82, 1, 1, 0, 1, 1 ) --60000(10분)

		add_random_area( 82, 121083, 58691, 121114, 58693 )  --작은 x값, 작은 y값, 큰 x값, 큰 y값 
		add_random_monster( 82, 22000076 , 100000000 )			-- 악몽의 눈사람

	-- 론도 
		set_random_respawn( 83, 60000, 83, 1, 1, 0, 1, 1 ) --60000(10분)
		--론도 대련장 중앙
		add_random_area( 83, 134447, 110595, 134485, 110630 )
		add_random_monster( 83, 22000076 , 100000000 )			-- 악몽의 눈사람	
		
	-- 잃어버린 비밀의 섬

        set_random_respawn( 84, 60000, 84, 1, 1, 0, 1, 1 ) --60000(10분)
        add_random_area( 84, 94569, 125941, 94570, 125942 )
        add_random_monster( 84, 22000076 , 100000000 ) -- 악몽의 눈사람
		
    --엘 카시아
		set_random_respawn( 86, 360000, 86, 1, 1, 0, 1, 1 ) --360000(60분)

		add_random_area( 86, 206487, 118997, 206488, 118998 ) 
		add_random_area( 86, 206064, 117701, 206065, 117702 )  
	
		add_random_monster( 86, 22000068 , 100000000 )	-- 악몽의 눈사람

		
	-- 숨겨진 엘 카시아
		set_random_respawn( 87, 360000, 87, 1, 1, 0, 1, 1 ) --360000(60분)

		add_random_area( 87, 189929, 20919, 189930, 20920 ) 
		add_random_area( 87, 190027, 23165, 190028, 23166 )  
	
		add_random_monster( 87, 22000069 , 100000000 )	-- 악몽의 눈사람


	--백룡의 쉼터
		set_random_respawn( 88, 360000, 88, 1, 1, 0, 1, 1 ) --360000(60분)

		add_random_area( 88, 201400, 170786, 201401, 170787 ) 
		add_random_area( 88, 200249, 172051, 200250, 172052 )  
	
		add_random_monster( 88, 22000070 , 100000000 )	-- 악몽의 눈사람


	--숨겨진 백룡의 쉼터
		set_random_respawn( 89, 360000, 89, 1, 1, 0, 1, 1 ) --360000(60분)

		add_random_area( 89, 169140, 25588, 169141, 25589 ) 
		add_random_area( 89, 168879, 26919, 168880, 26920 )  
	
		add_random_monster( 89, 22000071 , 100000000 )	-- 악몽의 눈사람
		

	--흑룡의 그늘
		set_random_respawn( 90, 360000, 90, 1, 1, 0, 1, 1 ) --360000(60분)

		add_random_area( 90, 200218, 153956, 200219, 153957 ) 
		add_random_area( 90, 201399, 154652, 201400, 154653 )  
	
		add_random_monster( 90, 22000072 , 100000000 )	-- 악몽의 눈사람


	--숨겨진 흑룡의 그늘
		set_random_respawn( 91, 360000, 91, 1, 1, 0, 1, 1 ) --360000(60분)

		add_random_area( 91, 153032, 25624, 153033, 25625 ) 
		add_random_area( 91, 152773, 26941, 152774, 26942 )  
	
		add_random_monster( 91, 22000073 , 100000000 )	-- 악몽의 눈사람



	--사룡의 심장
		set_random_respawn( 92, 360000, 92, 1, 1, 0, 1, 1 ) --360000(60분)

		add_random_area( 92, 201407, 138477, 201408, 138478 ) 
		add_random_area( 92, 201139, 139814, 201140, 139815 )  
	
		add_random_monster( 92, 22000074 , 100000000 )	-- 악몽의 눈사람


	--숨겨진 사룡의 심장
		set_random_respawn( 93, 360000, 93, 1, 1, 0, 1, 1 ) --360000(60분)

		add_random_area( 93, 136876, 25633, 136877, 25634 ) 
		add_random_area( 93, 136626, 26928, 136627, 26929 )  
	
		add_random_monster( 93, 22000075 , 100000000 )	-- 악몽의 눈사람


	end
	

--===================================서커스 앞마당 필드 몬스터 리스폰=========================================
--============================================================================================================


--사자 리젠
	set_random_respawn( 41, 1000, 41, 1, 1, 0, 4, 1 ) 
	
	add_random_area( 41, 36876,121128,	37212	,121380)
	add_random_area( 41, 37632,121086,	37926	,121254)
	add_random_area( 41, 37716,122094,	37884	,122388)
	
	add_random_monster( 41, 22000000 , 100000000 )		--사자<9.1><필드>
	
	
--백호 리젠
	set_random_respawn( 42, 1000, 42, 1, 1, 0, 4, 1 ) 
	
	add_random_area( 42, 36876,121128,	37212	,121380)
	add_random_area( 42, 37632,121086,	37926	,121254)
	add_random_area( 42, 37716,122094,	37884	,122388)
	
	add_random_monster( 42, 22000001 , 100000000 )		--백호<9.1><필드>

--사자 리젠
	set_random_respawn( 43, 1000, 43, 1, 1, 0, 4, 1 ) 
	
	add_random_area( 43, 36876,121128,	37212	,121380)
	add_random_area( 43, 37632,121086,	37926	,121254)
	add_random_area( 43, 37716,122094,	37884	,122388)
	
	add_random_monster( 43, 22000002 , 100000000 )		--사자<9.1><필드>
	
	
--백호 리젠
	set_random_respawn( 44, 1000, 44, 1, 1, 0, 4, 1 ) 
	
	add_random_area( 44, 36876,121128,	37212	,121380)
	add_random_area( 44, 37632,121086,	37926	,121254)
	add_random_area( 44, 37716,122094,	37884	,122388)
	
	add_random_monster( 44, 22000003 , 100000000 )		--백호<9.1><필드>


--사자 리젠
	set_random_respawn( 45, 1000, 45, 1, 1, 0, 4, 1 ) 
	
	add_random_area( 45, 38556,121632,	38976	,122094)
	add_random_area( 45, 40026,121758,	40530	,122178)
	add_random_area( 45, 40950,121506,	41454	,122010)
	
	add_random_monster( 45, 22000000 , 100000000 )		--사자<9.1><필드>
	
	
--백호 리젠
	set_random_respawn( 46, 1000, 46, 1, 1, 0, 4, 1 ) 
	
	add_random_area( 46, 38556,121632,	38976	,122094)
	add_random_area( 46, 40026,121758,	40530	,122178)
	add_random_area( 46, 40950,121506,	41454	,122010)
	
	add_random_monster( 46, 22000001 , 100000000 )		--백호<9.1><필드>

--사자 리젠
	set_random_respawn( 47, 1000, 47, 1, 1, 0, 4, 1 ) 
	
	add_random_area( 47, 38556,121632,	38976	,122094)
	add_random_area( 47, 40026,121758,	40530	,122178)
	add_random_area( 47, 40950,121506,	41454	,122010)
	
	add_random_monster( 47, 22000002 , 100000000 )		--사자<9.1><필드>
	
	
--백호 리젠
	set_random_respawn( 48, 1000, 48, 1, 1, 0, 4, 1 ) 
	
	add_random_area( 48, 38556,121632,	38976	,122094)
	add_random_area( 48, 40026,121758,	40530	,122178)
	add_random_area( 48, 40950,121506,	41454	,122010)
	
	add_random_monster( 48, 22000003 , 100000000 )		--백호<9.1><필드>

	
	
	
--사자 리젠
	set_random_respawn( 49, 1000, 49, 1, 1, 0, 4, 1 ) 
	
	add_random_area( 49, 42294,119196,	42672	,119532)
	add_random_area( 49, 41706,117138,	42126	,117600)
	add_random_area( 49, 40152,116172,	40740	,116172)
	
	add_random_monster( 49, 22000000 , 100000000 )		--사자<9.1><필드>
	
	
--백호 리젠
	set_random_respawn( 50, 1000, 50, 1, 1, 0, 4, 1 ) 
	
	add_random_area( 50, 42294,119196,	42672	,119532)
	add_random_area( 50, 41706,117138,	42126	,117600)
	add_random_area( 50, 40152,116172,	40740	,116172)
	
	add_random_monster( 50, 22000001 , 100000000 )		--백호<9.1><필드>

--사자 리젠
	set_random_respawn( 51, 1000, 51, 1, 1, 0, 4, 1 ) 
	
	add_random_area( 51, 42294,119196,	42672	,119532)
	add_random_area( 51, 41706,117138,	42126	,117600)
	add_random_area( 51, 40152,116172,	40740	,116172)
	
	add_random_monster( 51, 22000002 , 100000000 )		--사자<9.1><필드>
	
	
--백호 리젠
	set_random_respawn( 52, 1000, 52, 1, 1, 0, 4, 1 ) 
	
	add_random_area( 52, 42294,119196,	42672	,119532)
	add_random_area( 52, 41706,117138,	42126	,117600)
	add_random_area( 52, 40152,116172,	40740	,116172)
	
	add_random_monster( 52, 22000003 , 100000000 )		--백호<9.1><필드>

	
--===================================2014 9.1 업데이트 이벤트 랜덤 리스폰==============================
--============================================================================================================

	-- 이벤트때만 리스폰 하기 위해 국가 / 기간 제어
	
	-- check 가 1이 되야 이벤트 리스폰
	local check = 0
	
	-- 일본 이벤트 (8월 12일 ~ 9월 9일)
	if state_code == 16 and '2014-08-12 11:00:00' <= current_time and current_time < '2014-09-09 11:00' then
		check = 1 
	
	-- 러시아 이벤트 (9월 1일 ~ 9월 29일)
	elseif state_code == 256 and '2014-09-01 08:00:00' <= current_time and current_time < '2014-09-29 08:00:00' then
		check = 1 
		
	-- 미국 유럽 이벤트 (9월 2일 ~ 9월 30일 )
	elseif ( state_code == 4 or state_code == 8 or state_code == 128 or state_code == 16384 or state_code == 32768 or state_code == 65536 )
		and '2014-09-02 09:00:00' <= current_time and current_time < '2014-09-30 09:00:00' then
		check = 1
		
	-- 동남아 이벤트 (9월 5일 ~ 10월 3일)
	elseif state_code == 512 and '2014-09-05 11:00:00' <= current_time and current_time < '2014-10-03 11:00:00' then
		check = 1 
		
	-- 중동 9.1 (9월  23일 ~ 10월 21일)
	elseif state_code == 8192 and '2014-09-23 08:00:00' <= current_time and current_time < '2014-10-21 08:00:00' then
		check = 1
	end
	
	if check == 1 then
	--수정계곡 1
		set_random_respawn( 71, 180000, 71, 1, 0, 0, 1, 1 ) --180000(30분)

		add_random_area( 71, 218495, 59094, 218852, 59430 ) 
		add_random_area( 71, 220303,	63086	,220723,	63435)  
		add_random_area( 71, 224615,	61172	,224953,	61712)
		add_random_area( 71, 222423	,59335	,222753,	59731)
		add_random_area( 71, 224084	,56787	,224988,	57695)
		add_random_area( 71, 222083	,56712	,222773,	57034)
		add_random_area( 71, 221512	,61994	,222780,	62506)

		add_random_monster( 71, 1100057 , 100000000 )	-- 수정체


	--수정계곡 2
		set_random_respawn( 72, 180000, 72, 1, 0, 0, 1, 1 ) --180000(30분)

		add_random_area( 72, 218512,	91371	,218898,	91712)
		add_random_area( 72, 220720	,95711	,220744,	95714)
		add_random_area( 72, 224564,	93511	,225028,	93803)
		add_random_area( 72, 222386	,91645	,222759,	92020)
		add_random_area( 72, 221469,	94270,	222900,	94756)
		add_random_area( 72, 224078	,89042,	225018,	89968)
		add_random_area( 72, 222036	,88922,	222864,	89290)

		add_random_monster( 72, 1100057 , 100000000 )	-- 수정체


	--팔미르 1
		set_random_respawn( 73, 180000, 73, 1, 0, 0, 1, 1 ) --180000(30분)

		add_random_area( 73, 220066,	140525,	220634,	141095)
		add_random_area( 73, 222541,	142738,	223121,	143264)
		add_random_area( 73, 224481,	139406,	225014,	139837)
		add_random_area( 73, 217259,	136375,	218612,	137516)
		add_random_area( 73, 221210,	131856,	221655,	132303)
		add_random_area( 73, 214824,	130345,	215353,	130946 )--
		add_random_area( 73, 211615,	132682,	212322,	133203)
		add_random_area( 73, 211523,	138163,	212154,	138698)
		add_random_area( 73, 216281,	141877,	216767,	142369)

		add_random_monster( 73, 1100057 , 100000000 )	-- 수정체


	--팔미르 2
		set_random_respawn( 74, 180000, 74, 1, 0, 0, 1, 1 ) --180000(30분)

		add_random_area( 74, 216265,	158011,	216777,	158497)
		add_random_area( 74, 220058,	156716,	220580,	157175)
		add_random_area( 74, 222643,	158830,	223141,	159284)
		add_random_area( 74, 224509,	155533,	225030,	155945)
		add_random_area( 74, 221125,	148029,	221671,	148404)
		add_random_area( 74, 214778,	146492,	215353,	147073)
		add_random_area( 74, 211642,	148804,	212308,	149332)
		add_random_area( 74, 211525,	154303,	212124,	154818)
		add_random_area( 74, 217274,	152563,	218882,	153942)

		add_random_monster( 74, 1100057 , 100000000 )	-- 수정체

	--엘 카시아
		--맵툴 상에서 오른쪽 부터 왼쪽으로
		set_random_respawn( 75, 180000, 75, 1, 0, 0, 1, 1 ) --180000(30분)

		add_random_area( 75, 207244,	120007,	207578,	120202)
		add_random_area( 75, 207572,	118618	,207891 ,118811)
		add_random_area( 75, 207285	,117191	,207620	,117468)
		add_random_area( 75, 205110	,116429	,205455	,116550)
		add_random_area( 75, 204398	,117678	,204696	,117944)
		add_random_area( 75, 204226	,118944	,204496	,119187)
		--가운데 크게~
		add_random_area( 75,205827,	117432,	206379,	120303)

		add_random_monster( 75, 1100057 , 100000000 )	-- 수정체


	--백룡
		set_random_respawn( 76, 180000, 76, 1, 0, 0, 1, 1 ) --180000(30분)

		
		add_random_area( 76, 201266,	167859,	201601,	168020)
		add_random_area( 76, 201154,	170785,	201674,	171011)
		add_random_area( 76, 201068,	171944,	201767,	172386)
		add_random_area( 76, 200060,	172028,	200367, 172300)
		add_random_area( 76, 199574,	171071,	199856,	171309)
		add_random_area( 76, 199996,	170012,	200372,	170226)

		add_random_monster( 76, 1100057 , 100000000 )	-- 수정체


	--흑룡
		set_random_respawn( 77, 180000, 77, 1, 0, 0, 1, 1 ) --180000(30분)

		
		add_random_area( 77, 202079,	154977,	202400,	155081)
		add_random_area( 77, 202306,	155476,	202629,	155574)
		add_random_area( 77, 201117,154622,201664,154846)
		add_random_area( 77, 201025,155779,201674,156244)
		add_random_area( 77, 200090,155906,200353,156157)
		add_random_area( 77, 199574,154935,199853,155171)
		add_random_area( 77, 199983,153901,200330,154076)

		add_random_monster( 77, 1100057 , 100000000 )	-- 수정체

	--사룡
		set_random_respawn( 78, 180000, 78, 1, 0, 0, 1, 1 ) --180000(30분)

		add_random_area( 78, 202279,138953,	202394	,139853)
		add_random_area( 78, 201105,138501,	201674  ,138741)
		add_random_area( 78, 201030,139671,	201695	,140134)
		add_random_area( 78, 200075,139778,	200351	,140000)
		add_random_area( 78, 199571,138800,	199836	,139061)
		add_random_area( 78, 200001,137790,	200325	,137978)
		add_random_monster( 78, 1100057 , 100000000 )	-- 수정체

	--서커스 필드
		set_random_respawn( 79, 180000, 79, 1, 0, 0, 1, 1 ) 
		
		add_random_area( 79, 36876,121128,	37212	,121380)
		add_random_area( 79, 37632,121086,	37926	,121254)
		add_random_area( 79, 37716,122094,	37884	,122388)
		
		add_random_area( 79, 36876,121128,	37212	,121380)
		add_random_area( 79, 37632,121086,	37926	,121254)
		add_random_area( 79, 37716,122094,	37884	,122388)
		
		add_random_area( 79, 36876,121128,	37212	,121380)
		add_random_area( 79, 37632,121086,	37926	,121254)
		add_random_area( 79, 37716,122094,	37884	,122388)
		
		add_random_area( 79, 36876,121128,	37212	,121380)
		add_random_area( 79, 37632,121086,	37926	,121254)
		add_random_area( 79, 37716,122094,	37884	,122388)
		
		add_random_area( 79, 38556,121632,	38976	,122094)
		add_random_area( 79, 40026,121758,	40530	,122178)
		add_random_area( 79, 40950,121506,	41454	,122010)
		
		add_random_area( 79, 38556,121632,	38976	,122094)
		add_random_area( 79, 40026,121758,	40530	,122178)
		add_random_area( 79, 40950,121506,	41454	,122010)
		
		add_random_area( 79, 38556,121632,	38976	,122094)
		add_random_area( 79, 40026,121758,	40530	,122178)
		add_random_area( 79, 40950,121506,	41454	,122010)
		
		add_random_area( 79, 38556,121632,	38976	,122094)
		add_random_area( 79, 40026,121758,	40530	,122178)
		add_random_area( 79, 40950,121506,	41454	,122010)
		
		add_random_area( 79, 42294,119196,	42672	,119532)
		add_random_area( 79, 41706,117138,	42126	,117600)
		add_random_area( 79, 40152,116172,	40740	,116172)
		
		add_random_area( 79, 42294,119196,	42672	,119532)
		add_random_area( 79, 41706,117138,	42126	,117600)
		add_random_area( 79, 40152,116172,	40740	,116172)
		
		add_random_area( 79, 42294,119196,	42672	,119532)
		add_random_area( 79, 41706,117138,	42126	,117600)
		add_random_area( 79, 40152,116172,	40740	,116172)
		
		add_random_area( 79, 42294,119196,	42672	,119532)
		add_random_area( 79, 41706,117138,	42126	,117600)
		add_random_area( 79, 40152,116172,	40740	,116172)
		
		add_random_monster( 79, 1100057 , 100000000 )		-- 수정체
	end
	
--==============================================================================================================	
--==============================================================================================================	

end