--- Lua 스크립트 암호화.
function get_module_name()
             return "server_init"
end

function on_server_init()
	roaming()
	rare_mob()
	guardian_spawn()
	random_respawn()
	add_global_prop()
	for_event_by_liveteam() --라이브팀 사용 범위로 NPC_EVENT 스크립트에서 사용된다.
end

--function respawn_rare_mob( id, interval, x, y, mob_id, count, is_wandering )

--id: 쓰레기 값.-_- -1을 넣어주세요. 기존 함수와 호환성 유지를 위해.
--interval: 1/100초 단위. 1초는 100, 1분은 6000
--x: x좌표
--y: y좌표
--mob_id: 몬스터 id
--count: 숫자
--is_wandering: 로밍 여부. 1이면 로밍. 0이면 로밍 안 함.

function rare_mob()
	-- 요정의 숲 나르파
	respawn_rare_mob( -1, 60000, 133952, 156354, 58008, 1, 0 )
	
	-- 화형터 원한의 카둔
	respawn_rare_mob( -1, 60000, 121553, 73101, 42012, 1, 0 )
	
	-- 월화의 공동묘지 그리시스
	respawn_rare_mob( -1, 60000, 139908, 89679, 50017, 1, 0 )
	
	-- 가을걷이 숲 붉은 송곳
	respawn_rare_mob( -1, 60000, 127309, 143250, 37024, 1, 0 )
	-- 붉은 송곳 호위병 3마리 
	respawn_rare_mob( -1, 60000, 127297, 143278, 34012, 1, 0 )
	respawn_rare_mob( -1, 60000, 127343, 143261, 34012, 1, 0 )
	respawn_rare_mob( -1, 60000, 127295, 143224, 34012, 1, 0 )
	
	-- 암염광산 남쪽필드 가질라
	respawn_rare_mob( -1, 60000, 147395, 72845, 33024, 1, 1 )

	-- 엘 카시아 던전시즈 공격측, 방어측 시작지점에는 던전시즈시 규인화가 나오게 하지 않기 위해 
	-- 레어몹 리스폰 함수를 사용해서 일반던전과 레이드 시에만 배치한다.
	-- 던전시즈 시에는 리젠되지 않는다.
		-- 엘 카시아 금벽장 건 에 작은 규인화 배치 (던전코어 소속)
	respawn_rare_mob( -1, 12000, 205311, 116328, 140004, 1, 0 )
	
	-- 엘 카시아 수벽장 손 에 작은 규인화 배치 (던전코어 소속)
	respawn_rare_mob( -1, 12000, 207405, 120112, 140004, 1, 0 )
	
	
	--------------------------------------------------------
	-- 론도 - 전투 수련장 지역 1(입구에서 좌측)
	
	-- 앞줄
	respawn_rare_mob( -1, 12000, 138877, 107460, 1901, 1, 0 )
	respawn_rare_mob( -1, 12000, 138910, 107521, 10901, 1, 0 )
	respawn_rare_mob( -1, 12000, 138943, 107582, 20901, 1, 0 )
	respawn_rare_mob( -1, 12000, 138976, 107643, 30901, 1, 0 )
	respawn_rare_mob( -1, 12000, 139009, 107704, 40901, 1, 0 )
	                                             
	--뒷줄                                       
	respawn_rare_mob( -1, 12000, 138795, 107512, 50901, 1, 0 )
	respawn_rare_mob( -1, 12000, 138828, 107573, 60901, 1, 0 )
	respawn_rare_mob( -1, 12000, 138861, 107634, 70901, 1, 0 )
	respawn_rare_mob( -1, 12000, 138894, 107695, 80901, 1, 0 )
	respawn_rare_mob( -1, 12000, 138927, 107756, 90901, 1, 0 )
	
	-- 론도 - 전투 수련장 지역 2(입구에서 우측)
	
	-- 앞줄
	respawn_rare_mob( -1, 12000, 138966, 107300, 100901, 1, 0 )
	respawn_rare_mob( -1, 12000, 139027, 107301, 110901, 1, 0 )
	respawn_rare_mob( -1, 12000, 139088, 107302, 120901, 1, 0 )
	respawn_rare_mob( -1, 12000, 139149, 107303, 130901, 1, 0 )
	respawn_rare_mob( -1, 12000, 139210, 107304, 140901, 1, 0 )
	
	--뒷줄
	respawn_rare_mob( -1, 12000, 138995, 107195, 150901, 1, 0 )
	respawn_rare_mob( -1, 12000, 139056, 107196, 160901, 1, 0 )
	respawn_rare_mob( -1, 12000, 139117, 107197, 170901, 1, 0 )
	respawn_rare_mob( -1, 12000, 139178, 107198, 180901, 1, 0 )
	respawn_rare_mob( -1, 12000, 139239, 107199, 190901, 1, 0 )
		
	-- 론도 - 전투 수련장 지역 3(입구에서 정면)
	
	-- 앞줄
	respawn_rare_mob( -1, 12000, 139159, 107701, 1801, 1, 0 )
	respawn_rare_mob( -1, 12000, 139197, 107632, 10801, 1, 0 )
	respawn_rare_mob( -1, 12000, 139235, 107563, 20801, 1, 0 )
	respawn_rare_mob( -1, 12000, 139273, 107494, 30801, 1, 0 )
	respawn_rare_mob( -1, 12000, 139311, 107425, 40801, 1, 0 )
	
	--뒷줄
	respawn_rare_mob( -1, 12000, 139250, 107762, 50801, 1, 0 )
	respawn_rare_mob( -1, 12000, 139288, 107693, 60801, 1, 0 )
	respawn_rare_mob( -1, 12000, 139326, 107624, 70801, 1, 0 )
	respawn_rare_mob( -1, 12000, 139364, 107555, 80801, 1, 0 )
	respawn_rare_mob( -1, 12000, 139402, 107486, 90801, 1, 0 )
	
	--------------------------------------------------------
	-- 라크시의닻 - 전투 수련장 지역 1(입구에서 좌측)
	
	-- 앞줄
	respawn_rare_mob( -1, 12000, 121132, 138123, 1801, 1, 0 )
	respawn_rare_mob( -1, 12000, 121104, 138061, 10801, 1, 0 )
	respawn_rare_mob( -1, 12000, 121076, 137999, 20801, 1, 0 )
	respawn_rare_mob( -1, 12000, 121048, 137937, 30801, 1, 0 )
	respawn_rare_mob( -1, 12000, 121020, 137875, 40801, 1, 0 )
	                                             
	--뒷줄                                       
	respawn_rare_mob( -1, 12000, 121241, 138077, 50801, 1, 0 )
	respawn_rare_mob( -1, 12000, 121213, 138015, 60801, 1, 0 )
	respawn_rare_mob( -1, 12000, 121185, 137953, 70801, 1, 0 )
	respawn_rare_mob( -1, 12000, 121157, 137891, 80801, 1, 0 )
	respawn_rare_mob( -1, 12000, 121129, 137829, 90801, 1, 0 )
	                                             
	-- 라크시의닻 - 전투 수련장 지역 2(입구에서 우측)
	                                             
	-- 앞줄                                      
	respawn_rare_mob( -1, 12000, 120976, 138232, 100801, 1, 0 )
	respawn_rare_mob( -1, 12000, 120916, 138215, 110801, 1, 0 )
	respawn_rare_mob( -1, 12000, 120856, 138198, 120801, 1, 0 )
	respawn_rare_mob( -1, 12000, 120796, 138181, 130801, 1, 0 )
	respawn_rare_mob( -1, 12000, 120736, 138164, 140801, 1, 0 )
	                                             
	--뒷줄                                       
	respawn_rare_mob( -1, 12000, 120908, 138327, 150801, 1, 0 )
	respawn_rare_mob( -1, 12000, 120848, 138310, 160801, 1, 0 )
	respawn_rare_mob( -1, 12000, 120788, 138293, 170801, 1, 0 )
	respawn_rare_mob( -1, 12000, 120728, 138276, 180801, 1, 0 )
	respawn_rare_mob( -1, 12000, 120668, 138259, 190801, 1, 0 )
		                                         
	-- 라크시의닻 - 전투 수련장 지역 3(입구에서 정면)
	                                             
	-- 앞줄                                      
	respawn_rare_mob( -1, 12000, 120698, 138016, 1901, 1, 0 )
	respawn_rare_mob( -1, 12000, 120740, 137972, 10901, 1, 0 )
	respawn_rare_mob( -1, 12000, 120782, 137928, 20901, 1, 0 )
	respawn_rare_mob( -1, 12000, 120824, 137884, 30901, 1, 0 )
	respawn_rare_mob( -1, 12000, 120866, 137840, 40901, 1, 0 )
	                                             
	--뒷줄                                       
	respawn_rare_mob( -1, 12000, 120622, 137910, 50901, 1, 0 )
	respawn_rare_mob( -1, 12000, 120664, 137866, 60901, 1, 0 )
	respawn_rare_mob( -1, 12000, 120706, 137822, 70901, 1, 0 )
	respawn_rare_mob( -1, 12000, 120748, 137778, 80901, 1, 0 )
	respawn_rare_mob( -1, 12000, 120790, 137734, 90901, 1, 0 )	
	
	--------------------------------------------------------
	-- 카탄 - 전투 수련장 지역 1(입구에서 좌측)
	
	-- 앞줄
	respawn_rare_mob( -1, 12000, 118693, 56872, 1801, 1, 0 )
	respawn_rare_mob( -1, 12000, 118667, 56810, 10801, 1, 0 )
	respawn_rare_mob( -1, 12000, 118641, 56748, 20801, 1, 0 )
	respawn_rare_mob( -1, 12000, 118615, 56686, 30801, 1, 0 )
	respawn_rare_mob( -1, 12000, 118589, 56624, 40801, 1, 0 )
	                                             
	--뒷줄                                       
	respawn_rare_mob( -1, 12000, 118790, 56835, 50801, 1, 0 )
	respawn_rare_mob( -1, 12000, 118764, 56773, 60801, 1, 0 )
	respawn_rare_mob( -1, 12000, 118738, 56711, 70801, 1, 0 )
	respawn_rare_mob( -1, 12000, 118712, 56649, 80801, 1, 0 )
	respawn_rare_mob( -1, 12000, 118686, 56587, 90801, 1, 0 )
	                                             
	-- 카탄 - 전투 수련장 지역 2(입구에서 우측) 
	                                             
	-- 앞줄                                      
	respawn_rare_mob( -1, 12000, 118541, 56996, 100801, 1, 0 )
	respawn_rare_mob( -1, 12000, 118484, 56982, 110801, 1, 0 )
	respawn_rare_mob( -1, 12000, 118427, 56968, 120801, 1, 0 )
	respawn_rare_mob( -1, 12000, 118370, 56954, 130801, 1, 0 )
	respawn_rare_mob( -1, 12000, 118313, 56940, 140801, 1, 0 )
	                                             
	--뒷줄                                       
	respawn_rare_mob( -1, 12000, 118512, 57097, 150801, 1, 0 )
	respawn_rare_mob( -1, 12000, 118455, 57083, 160801, 1, 0 )
	respawn_rare_mob( -1, 12000, 118398, 57069, 170801, 1, 0 )
	respawn_rare_mob( -1, 12000, 118341, 57055, 180801, 1, 0 )
	respawn_rare_mob( -1, 12000, 118284, 57041, 190801, 1, 0 )
		                                         
	-- 카탄 - 전투 수련장 지역 3(입구에서 정면) 
	                                             
	-- 앞줄                                      
	respawn_rare_mob( -1, 12000, 118215, 56785, 1901, 1, 0 )
	respawn_rare_mob( -1, 12000, 118270, 56724, 10901, 1, 0 )
	respawn_rare_mob( -1, 12000, 118325, 56663, 20901, 1, 0 )
	respawn_rare_mob( -1, 12000, 118380, 56602, 30901, 1, 0 )
	respawn_rare_mob( -1, 12000, 118435, 56541, 40901, 1, 0 )
	                                             
	--뒷줄                                       
	respawn_rare_mob( -1, 12000, 118148, 56716, 50901, 1, 0 )
	respawn_rare_mob( -1, 12000, 118203, 56655, 60901, 1, 0 )
	respawn_rare_mob( -1, 12000, 118258, 56594, 70901, 1, 0 )
	respawn_rare_mob( -1, 12000, 118313, 56533, 80901, 1, 0 )
	respawn_rare_mob( -1, 12000, 118368, 56472, 90901, 1, 0 )		
	
	--------------------------------------------------------
	-- 호라이즌 - 전투 수련장 지역 1(입구에서 좌측)
	
	-- 앞줄
	respawn_rare_mob( -1, 12000, 154217, 76843, 1801, 1, 0 )
	respawn_rare_mob( -1, 12000, 154264, 76878, 10801, 1, 0 )
	respawn_rare_mob( -1, 12000, 154311, 76913, 20801, 1, 0 )
	respawn_rare_mob( -1, 12000, 154358, 76948, 30801, 1, 0 )
	respawn_rare_mob( -1, 12000, 154405, 76983, 40801, 1, 0 )
	                                              
	--뒷줄                                        
	respawn_rare_mob( -1, 12000, 154138, 76906, 50801, 1, 0 )
	respawn_rare_mob( -1, 12000, 154195, 76950, 60801, 1, 0 )
	respawn_rare_mob( -1, 12000, 154252, 76994, 70801, 1, 0 )
	respawn_rare_mob( -1, 12000, 154309, 77038, 80801, 1, 0 )
	respawn_rare_mob( -1, 12000, 154366, 77082, 90801, 1, 0 )
	                                              
	-- 호라이즌 - 전투 수련장 지역 2(입구에서 우측
	                                              
	-- 앞줄                                       
	respawn_rare_mob( -1, 12000, 154197, 76636, 100801, 1, 0 )
	respawn_rare_mob( -1, 12000, 154272, 76619, 110801, 1, 0 )
	respawn_rare_mob( -1, 12000, 154347, 76602, 120801, 1, 0 )
	respawn_rare_mob( -1, 12000, 154422, 76585, 130801, 1, 0 )
	respawn_rare_mob( -1, 12000, 154497, 76568, 140801, 1, 0 )
	                                              
	--뒷줄                                        
	respawn_rare_mob( -1, 12000, 154193, 76519, 150801, 1, 0 )
	respawn_rare_mob( -1, 12000, 154268, 76502, 160801, 1, 0 )
	respawn_rare_mob( -1, 12000, 154343, 76485, 170801, 1, 0 )
	respawn_rare_mob( -1, 12000, 154418, 76468, 180801, 1, 0 )
	respawn_rare_mob( -1, 12000, 154493, 76451, 190801, 1, 0 )
		                                          
	-- 호라이즌 - 전투 수련장 지역 3(입구에서 정면
	                                              
	-- 앞줄                                       
	respawn_rare_mob( -1, 12000, 154597, 76661, 1901, 1, 0 )
	respawn_rare_mob( -1, 12000, 154592, 76740, 10901, 1, 0 )
	respawn_rare_mob( -1, 12000, 154587, 76819, 20901, 1, 0 )
	respawn_rare_mob( -1, 12000, 154582, 76898, 30901, 1, 0 )
	respawn_rare_mob( -1, 12000, 154577, 76977, 40901, 1, 0 )
	                                              
	--뒷줄                                        
	respawn_rare_mob( -1, 12000, 154697, 76679, 50901, 1, 0 )
	respawn_rare_mob( -1, 12000, 154692, 76758, 60901, 1, 0 )
	respawn_rare_mob( -1, 12000, 154687, 76837, 70901, 1, 0 )
	respawn_rare_mob( -1, 12000, 154682, 76916, 80901, 1, 0 )
	respawn_rare_mob( -1, 12000, 154677, 76995, 90901, 1, 0 )		
	
	--------------------------------------------------------
	-- 시크루트 - 전투 수련장 지역 1(입구에서 좌측)
	
	-- 앞줄
	respawn_rare_mob( -1, 12000, 223516, 19170, 1901, 1, 0 )
	respawn_rare_mob( -1, 12000, 223585, 19137, 10901, 1, 0 )
	respawn_rare_mob( -1, 12000, 223654, 19104, 20901, 1, 0 )
	respawn_rare_mob( -1, 12000, 223723, 19071, 30901, 1, 0 )
	respawn_rare_mob( -1, 12000, 223792, 19038, 40901, 1, 0 )
	                                             
	--뒷줄                                       
	respawn_rare_mob( -1, 12000, 223570, 19268, 50901, 1, 0 )
	respawn_rare_mob( -1, 12000, 223639, 19235, 60901, 1, 0 )
	respawn_rare_mob( -1, 12000, 223708, 19202, 70901, 1, 0 )
	respawn_rare_mob( -1, 12000, 223777, 19169, 80901, 1, 0 )
	respawn_rare_mob( -1, 12000, 223846, 19136, 90901, 1, 0 )
	                                             
	-- 시크루트 - 전투 수련장 지역 2(입구에서 우측
	                                             
	-- 앞줄                                      
	respawn_rare_mob( -1, 12000, 223386, 19043, 100901, 1, 0 )
	respawn_rare_mob( -1, 12000, 223408, 18966, 110901, 1, 0 )
	respawn_rare_mob( -1, 12000, 223430, 18889, 120901, 1, 0 )
	respawn_rare_mob( -1, 12000, 223452, 18812, 130901, 1, 0 )
	respawn_rare_mob( -1, 12000, 223474, 18735, 140901, 1, 0 )
	                                             
	--뒷줄                                       
	respawn_rare_mob( -1, 12000, 223282, 19025, 150901, 1, 0 )
	respawn_rare_mob( -1, 12000, 223304, 18948, 160901, 1, 0 )
	respawn_rare_mob( -1, 12000, 223326, 18871, 170901, 1, 0 )
	respawn_rare_mob( -1, 12000, 223348, 18794, 180901, 1, 0 )
	respawn_rare_mob( -1, 12000, 223370, 18717, 190901, 1, 0 )
		                                         
	-- 시크루트 - 전투 수련장 지역 3(입구에서 정면
	                                             
	-- 앞줄                                      
	respawn_rare_mob( -1, 12000, 223619, 18737, 1801, 1, 0 )
	respawn_rare_mob( -1, 12000, 223684, 18776, 10801, 1, 0 )
	respawn_rare_mob( -1, 12000, 223749, 18815, 20801, 1, 0 )
	respawn_rare_mob( -1, 12000, 223814, 18854, 30801, 1, 0 )
	respawn_rare_mob( -1, 12000, 223879, 18893, 40801, 1, 0 )
	                                             
	--뒷줄                                       
	respawn_rare_mob( -1, 12000, 223681, 18668, 50801, 1, 0 )
	respawn_rare_mob( -1, 12000, 223746, 18707, 60801, 1, 0 )
	respawn_rare_mob( -1, 12000, 223811, 18746, 70801, 1, 0 )
	respawn_rare_mob( -1, 12000, 223876, 18785, 80801, 1, 0 )
	respawn_rare_mob( -1, 12000, 223941, 18824, 90801, 1, 0 )	
	
	--function respawn_rare_mob( id, interval, x, y, mob_id, count, is_wandering )

	--id: 쓰레기 값.-_- -1을 넣어주세요. 기존 함수와 호환성 유지를 위해.
	--interval: 1/100초 단위. 1초는 100, 1분은 6000
	--x: x좌표
	--y: y좌표
	--mob_id: 몬스터 id
	--count: 숫자
	--is_wandering: 로밍 여부. 1이면 로밍. 0이면 로밍 안 함.

	-- 에스포에 4지역(루시앙 사념체)
	respawn_rare_mob( -1, 90000, 28414, 19566, 185002, 1, 0 )
	
end


-- <가디언을 소환하는 함수>
-- respawn_guardian( dungeon_id, id, interval, x, y, mob_id, count, is_wandering )
-- id는 여전히 쓰레기 값이니 -1을 넣어주시면 됩니다. 나머지는 이전 함수와 동일합니다.


-- <혼유석, 규인화등 제자리에 있는 몬스터를 소환하는 함수>
-- respawn_environmental_guardian( dungeon_id, id, interval, x, y, mob_id, count, is_wandering )
-- 던전시즈 중에 코어 소유권에 따른 피아식별 가능하다.
-- 레이드때에도 등장하며, 레이드 중에 죽으면 리젠 되지 않는다.
-- 일반 던전의 배치도 이 함수를 사용하여 한다.
-- id 는 해당 혼유석, 규인화가 속해있는 던전코어 및 제어장치의 id를 입력하면 된다.
-- 0 : 던전코어
-- 1 : 제어장치 1번
-- 2 : 제어장치 2번 등 순서대로 제어장치의 순서 id를 입력하면 된다. 
-- id가 코어나 제어장치에 아무것도 해당되지 않는 값이 입력되어 있다면 처음부터 끝까지 던전 방어자 길드를 지키게 된다.


function guardian_spawn()
	-- 가디언을 배치하는 함수 입니다.
	

	-- 잃어버린 갱도 제 1 탄광	
		-- 제어장치1
		respawn_guardian( 130000, 1, 180000, 219795, 13283, 8065001, 1,  0 )
		respawn_guardian( 130000, 1, 180000, 219710, 13278, 8065001, 1,  0 )
		
		-- 제어장치2
		respawn_guardian( 130000, 2, 180000, 223528, 12343, 8065001, 1,  0 )
		respawn_guardian( 130000, 2, 180000, 223453, 12337, 8065001, 1,  0 )
		
		-- 제어장치3
		respawn_guardian( 130000, 3, 180000, 218575, 10130, 8065001, 1,  0 )
		respawn_guardian( 130000, 3, 180000, 218504, 10127, 8065001, 1,  0 )
		
		-- 제어장치4
		respawn_guardian( 130000, 4, 180000, 222123, 9169, 8065001, 1,  0 )
		respawn_guardian( 130000, 4, 180000, 222205, 9169, 8065001, 1,  0 )
		
		-- 던전 코어
		respawn_guardian( 130000, 0, 180000, 224072, 9714, 8070001, 1,  0 )
		respawn_guardian( 130000, 0, 180000, 224074, 9625, 8070001, 1,  0 )
		
	-- 잃어버린 갱도 제 2 탄광	
		-- 제어장치1
		respawn_guardian( 130600, 1, 180000, 219795, 110051, 8065002, 1,  0 )
		respawn_guardian( 130600, 1, 180000, 219710, 110046, 8065002, 1,  0 )
		
		-- 제어장치2
		respawn_guardian( 130600, 2, 180000, 223528, 109111, 8065002, 1,  0 )
		respawn_guardian( 130600, 2, 180000, 223453, 109105, 8065002, 1,  0 )
		
		-- 제어장치3
		respawn_guardian( 130600, 3, 180000, 218575, 106898, 8065002, 1,  0 )
		respawn_guardian( 130600, 3, 180000, 218504, 106895, 8065002, 1,  0 )
		
		-- 제어장치4
		respawn_guardian( 130600, 4, 180000, 222123, 105937, 8065002, 1,  0 )
		respawn_guardian( 130600, 4, 180000, 222205, 105937, 8065002, 1,  0 )
		
		-- 던전 코어
		respawn_guardian( 130600, 0, 180000, 224072, 106482, 8070002, 1,  0 )
		respawn_guardian( 130600, 0, 180000, 224074, 106393, 8070002, 1,  0 )
		
	-- 제 1 수정 계곡	
		-- 제어장치1
		respawn_guardian( 130300, 1, 180000, 218735, 59306, 8085001, 1,  0 )
		respawn_guardian( 130300, 1, 180000, 218682, 59225, 8085001, 1,  0 )
		respawn_guardian( 130300, 1, 180000, 218627, 59277, 8085001, 1,  0 )
		respawn_guardian( 130300, 1, 180000, 218683, 59343, 8085001, 1,  0 )
		
		-- 제어장치2
		respawn_guardian( 130300, 2, 180000, 220483, 63231, 8085001, 1,  0 )
		respawn_guardian( 130300, 2, 180000, 220481, 63306, 8085001, 1,  0 )
		respawn_guardian( 130300, 2, 180000, 220565, 63317, 8085001, 1,  0 )
		respawn_guardian( 130300, 2, 180000, 220567, 63226, 8085001, 1,  0 )
		
		-- 제어장치3
		respawn_guardian( 130300, 3, 180000, 222607, 59538, 8085001, 1,  0 )
		respawn_guardian( 130300, 3, 180000, 222538, 59543, 8085001, 1,  0 )
		respawn_guardian( 130300, 3, 180000, 222528, 59618, 8085001, 1,  0 )
		respawn_guardian( 130300, 3, 180000, 222605, 59624, 8085001, 1,  0 )
		
		-- 제어장치4
		respawn_guardian( 130300, 4, 180000, 224832, 61410, 8085001, 1,  0 )
		respawn_guardian( 130300, 4, 180000, 224791, 61348, 8085001, 1,  0 )
		respawn_guardian( 130300, 4, 180000, 224844, 61298, 8085001, 1,  0 )
		respawn_guardian( 130300, 4, 180000, 224895, 61360, 8085001, 1,  0 )
		
		-- 던전 코어
		respawn_guardian( 130300, 0, 180000, 224614, 57322, 8090001, 1,  0 )
		respawn_guardian( 130300, 0, 180000, 224557, 57228, 8090001, 1,  0 )
		respawn_guardian( 130300, 0, 180000, 224617, 57136, 8090001, 1,  0 )
		respawn_guardian( 130300, 0, 180000, 224673, 57226, 8090001, 1,  0 )
		
	-- 제 2 수정 계곡
		-- 제어장치1
		respawn_guardian( 130500, 1, 180000, 218735, 91562, 8085002, 1,  0 )
		respawn_guardian( 130500, 1, 180000, 218682, 91481, 8085002, 1,  0 )
		respawn_guardian( 130500, 1, 180000, 218627, 91533, 8085002, 1,  0 )
		respawn_guardian( 130500, 1, 180000, 218683, 91599, 8085002, 1,  0 )
		
		-- 제어장치2
		respawn_guardian( 130500, 2, 180000, 220483, 95487, 8085002, 1,  0 )
		respawn_guardian( 130500, 2, 180000, 220481, 95562, 8085002, 1,  0 )
		respawn_guardian( 130500, 2, 180000, 220565, 95573, 8085002, 1,  0 )
		respawn_guardian( 130500, 2, 180000, 220567, 95482, 8085002, 1,  0 )
		
		-- 제어장치3
		respawn_guardian( 130500, 3, 180000, 222607, 91794, 8085002, 1,  0 )
		respawn_guardian( 130500, 3, 180000, 222538, 91799, 8085002, 1,  0 )
		respawn_guardian( 130500, 3, 180000, 222528, 91874, 8085002, 1,  0 )
		respawn_guardian( 130500, 3, 180000, 222605, 91880, 8085002, 1,  0 )
		
		-- 제어장치4
		respawn_guardian( 130500, 4, 180000, 224832, 93666, 8085002, 1,  0 )
		respawn_guardian( 130500, 4, 180000, 224791, 93604, 8085002, 1,  0 )
		respawn_guardian( 130500, 4, 180000, 224844, 93554, 8085002, 1,  0 )
		respawn_guardian( 130500, 4, 180000, 224895, 93616, 8085002, 1,  0 )
		
		-- 던전 코어
		respawn_guardian( 130500, 0, 180000, 224614, 89578, 8090002, 1,  0 )
		respawn_guardian( 130500, 0, 180000, 224557, 89484, 8090002, 1,  0 )
		respawn_guardian( 130500, 0, 180000, 224617, 89392, 8090002, 1,  0 )
		respawn_guardian( 130500, 0, 180000, 224673, 89482, 8090002, 1,  0 )

	-- 메마른 달빛의 유적 제 1 실	
		-- 제어장치1
		respawn_guardian( 130400, 1, 180000, 219221, 73233, 8045001, 1,  0 )
				
		-- 제어장치2
		respawn_guardian( 130400, 2, 180000, 224054, 75597, 8045001, 1,  0 )
		
		-- 제어장치3
		respawn_guardian( 130400, 3, 180000, 217843, 75949, 8045001, 1,  0 )
		
		-- 제어장치4
		respawn_guardian( 130400, 4, 180000, 221120, 78690, 8045001, 1,  0 )
		
		-- 던전 코어
		respawn_guardian( 130400, 0, 180000, 220740, 75096, 8050001, 1,  0 )

		
	-- 메마른 달빛의 유적 제 2 실	
		-- 제어장치1
		respawn_guardian( 130700, 1, 180000, 219221, 121617, 8045002, 1,  0 )
		
		-- 제어장치2
		respawn_guardian( 130700, 2, 180000, 224054, 123981, 8045002, 1,  0 )
		
		-- 제어장치3
		respawn_guardian( 130700, 3, 180000, 217843, 124333, 8045002, 1,  0 )
		
		-- 제어장치4
		respawn_guardian( 130700, 4, 180000, 221120, 127074, 8045002, 1,  0 )
		
		-- 던전 코어
		respawn_guardian( 130700, 0, 180000, 220740, 123480, 8050002, 1,  0 )
		
	-- 제 1 팔미르 유적
		-- 제어장치1
		respawn_guardian( 130800, 1, 180000, 211946, 133030, 8105001, 1,  0 )
		respawn_guardian( 130800, 1, 180000, 211880, 132961, 8105001, 1,  0 )
		respawn_guardian( 130800, 1, 180000, 211948, 132894, 8105001, 1,  0 )
		respawn_guardian( 130800, 1, 180000, 212010, 132960, 8105001, 1,  0 )
		
		-- 제어장치2
		respawn_guardian( 130800, 2, 180000, 215071, 130712, 8105001, 1,  0 )
		respawn_guardian( 130800, 2, 180000, 215005, 130646, 8105001, 1,  0 )
		respawn_guardian( 130800, 2, 180000, 215069, 130588, 8105001, 1,  0 )
		respawn_guardian( 130800, 2, 180000, 215126, 130650, 8105001, 1,  0 )
		
		-- 제어장치3
		respawn_guardian( 130800, 3, 180000, 211753, 138473, 8105001, 1,  0 )
		respawn_guardian( 130800, 3, 180000, 211691, 138410, 8105001, 1,  0 )
		respawn_guardian( 130800, 3, 180000, 211754, 138343, 8105001, 1,  0 )
		respawn_guardian( 130800, 3, 180000, 211816, 138409, 8105001, 1,  0 )
		
		-- 제어장치4
		respawn_guardian( 130800, 4, 180000, 221489, 132171, 8105001, 1,  0 )
		respawn_guardian( 130800, 4, 180000, 221403, 132172, 8105001, 1,  0 )
		respawn_guardian( 130800, 4, 180000, 221402, 132087, 8105001, 1,  0 )
		respawn_guardian( 130800, 4, 180000, 221491, 132085, 8105001, 1,  0 )
		
		-- 제어장치5
		respawn_guardian( 130800, 5, 180000, 216516, 142175, 8105001, 1,  0 )
		respawn_guardian( 130800, 5, 180000, 216441, 142108, 8105001, 1,  0 )
		respawn_guardian( 130800, 5, 180000, 216515, 142033, 8105001, 1,  0 )
		respawn_guardian( 130800, 5, 180000, 216587, 142106, 8105001, 1,  0 )

		-- 제어장치6
		respawn_guardian( 130800, 6, 180000, 224730, 139681, 8105001, 1,  0 )
		respawn_guardian( 130800, 6, 180000, 224714, 139582, 8105001, 1,  0 )
		respawn_guardian( 130800, 6, 180000, 224808, 139566, 8105001, 1,  0 )
		respawn_guardian( 130800, 6, 180000, 224826, 139657, 8105001, 1,  0 )
				
		-- 제어장치7
		respawn_guardian( 130800, 7, 180000, 220464, 140875, 8105001, 1,  0 )
		respawn_guardian( 130800, 7, 180000, 220361, 140892, 8105001, 1,  0 )
		respawn_guardian( 130800, 7, 180000, 220366, 140794, 8105001, 1,  0 )
		respawn_guardian( 130800, 7, 180000, 220463, 140773, 8105001, 1,  0 )
		
		-- 던전 코어
		respawn_guardian( 130800, 0, 180000, 218103, 137132, 8110001, 1,  0 )
		respawn_guardian( 130800, 0, 180000, 218087, 136877, 8110001, 1,  0 )
		respawn_guardian( 130800, 0, 180000, 217825, 136854, 8110001, 1,  0 )
		respawn_guardian( 130800, 0, 180000, 217843, 137120, 8110001, 1,  0 )
		
	-- 제 2 팔미르 유적
		-- 제어장치1
		respawn_guardian( 130900, 1, 180000, 211946, 149158, 8105002, 1,  0 )
		respawn_guardian( 130900, 1, 180000, 211880, 149089, 8105002, 1,  0 )
		respawn_guardian( 130900, 1, 180000, 211948, 149022, 8105002, 1,  0 )
		respawn_guardian( 130900, 1, 180000, 212010, 149088, 8105002, 1,  0 )
		
		-- 제어장치2
		respawn_guardian( 130900, 2, 180000, 215071, 146840, 8105002, 1,  0 )
		respawn_guardian( 130900, 2, 180000, 215005, 146774, 8105002, 1,  0 )
		respawn_guardian( 130900, 2, 180000, 215069, 146716, 8105002, 1,  0 )
		respawn_guardian( 130900, 2, 180000, 215126, 146778, 8105002, 1,  0 )
		
		-- 제어장치3
		respawn_guardian( 130900, 3, 180000, 211753, 154601, 8105002, 1,  0 )
		respawn_guardian( 130900, 3, 180000, 211691, 154538, 8105002, 1,  0 )
		respawn_guardian( 130900, 3, 180000, 211754, 154471, 8105002, 1,  0 )
		respawn_guardian( 130900, 3, 180000, 211816, 154537, 8105002, 1,  0 )

		-- 제어장치4
		respawn_guardian( 130900, 4, 180000, 221489, 148299, 8105002, 1,  0 )
		respawn_guardian( 130900, 4, 180000, 221403, 148300, 8105002, 1,  0 )
		respawn_guardian( 130900, 4, 180000, 221402, 148221, 8105002, 1,  0 )
		respawn_guardian( 130900, 4, 180000, 221491, 148213, 8105002, 1,  0 )

		-- 제어장치5
		respawn_guardian( 130900, 5, 180000, 216516, 158303, 8105002, 1,  0 )
		respawn_guardian( 130900, 5, 180000, 216441, 158236, 8105002, 1,  0 )
		respawn_guardian( 130900, 5, 180000, 216515, 158161, 8105002, 1,  0 )
		respawn_guardian( 130900, 5, 180000, 216587, 158234, 8105002, 1,  0 )
		
		-- 제어장치6
		respawn_guardian( 130900, 6, 180000, 224730, 155809, 8105002, 1,  0 )
		respawn_guardian( 130900, 6, 180000, 224714, 155710, 8105002, 1,  0 )
		respawn_guardian( 130900, 6, 180000, 224808, 155694, 8105002, 1,  0 )
		respawn_guardian( 130900, 6, 180000, 224826, 155785, 8105002, 1,  0 )
		
		-- 제어장치7
		respawn_guardian( 130900, 7, 180000, 220464, 157003, 8105002, 1,  0 )
		respawn_guardian( 130900, 7, 180000, 220361, 157020, 8105002, 1,  0 )
		respawn_guardian( 130900, 7, 180000, 220366, 156922, 8105002, 1,  0 )
		respawn_guardian( 130900, 7, 180000, 220463, 156901, 8105002, 1,  0 )

		-- 몬스터 
		-- 던전 코어
		respawn_guardian( 130900, 0, 180000, 218103, 153260, 8105001, 1,  0 )
		respawn_guardian( 130900, 0, 180000, 218087, 153005, 8105001, 1,  0 )
		respawn_guardian( 130900, 0, 180000, 217825, 152982, 8105001, 1,  0 )
		respawn_guardian( 130900, 0, 180000, 217843, 153248, 8105001, 1,  0 )

		
	-- 백룡의 쉼터	
		-- 제어장치1
		respawn_guardian( 121000, 1, 180000, 202180, 170223, 8140001, 1,  0 )
		respawn_guardian( 121000, 1, 180000, 202157, 170242, 8140001, 1,  0 )
		respawn_guardian( 121000, 1, 180000, 202138, 170222, 8140001, 1,  0 )
		respawn_guardian( 121000, 1, 180000, 202158, 170203, 8140001, 1,  0 )
		
		-- 제어장치2
		respawn_guardian( 121000, 2, 180000, 201351, 169107, 8135001, 1,  0 )
		respawn_guardian( 121000, 2, 180000, 201444, 169103, 8135001, 1,  0 )
		respawn_guardian( 121000, 2, 180000, 201401, 169139, 8135001, 1,  0 )
		respawn_guardian( 121000, 2, 180000, 201400, 169071, 8135001, 1,  0 )
		

		-- 던전 코어
		respawn_guardian( 121000, 0, 180000, 201134, 172158, 8140001, 1,  0 )
		respawn_guardian( 121000, 0, 180000, 201067, 172109, 8140001, 1,  0 )
		respawn_guardian( 121000, 0, 180000, 201159, 172021, 8140001, 1,  0 )
		respawn_guardian( 121000, 0, 180000, 201230, 172077, 8140001, 1,  0 )		
	
		
	-- 흑룡의 그늘 	
		-- 제어장치1
		respawn_guardian( 122000, 1, 180000, 202186, 154095, 8155001, 1,  0 )
		respawn_guardian( 122000, 1, 180000, 202130, 154093, 8155001, 1,  0 )
		respawn_guardian( 122000, 1, 180000, 202156, 154069, 8155001, 1,  0 )
		respawn_guardian( 122000, 1, 180000, 202160, 154120, 8155001, 1,  0 )
		
		-- 제어장치2
		respawn_guardian( 122000, 2, 180000, 201362, 152977, 8155001, 1,  0 )
		respawn_guardian( 122000, 2, 180000, 201431, 152974, 8155001, 1,  0 )
		respawn_guardian( 122000, 2, 180000, 201398, 152945, 8155001, 1,  0 )
		respawn_guardian( 122000, 2, 180000, 201402, 153013, 8155001, 1,  0 )
		

		-- 던전 코어
		respawn_guardian( 122000, 0, 180000, 201113, 155917, 8160002, 1,  0 )
		respawn_guardian( 122000, 0, 180000, 201034, 155975, 8160002, 1,  0 )
		respawn_guardian( 122000, 0, 180000, 201186, 155973, 8160002, 1,  0 )
		respawn_guardian( 122000, 0, 180000, 201108, 156036, 8160002, 1,  0 )		
	
	-- 사룡의 심장
		-- 제어장치1
		respawn_guardian( 123000, 1, 180000, 202185, 137966, 8175001, 1,  0 )
		respawn_guardian( 123000, 1, 180000, 202132, 137973, 8175001, 1,  0 )
		respawn_guardian( 123000, 1, 180000, 202157, 137941, 8175001, 1,  0 )
		respawn_guardian( 123000, 1, 180000, 202164, 137993, 8175001, 1,  0 )
		
		-- 제어장치2
		respawn_guardian( 123000, 2, 180000, 201356, 136845, 8175001, 1,  0 )
		respawn_guardian( 123000, 2, 180000, 201442, 136840, 8175001, 1,  0 )
		respawn_guardian( 123000, 2, 180000, 201404, 136882, 8175001, 1,  0 )
		respawn_guardian( 123000, 2, 180000, 201400, 136817, 8175001, 1,  0 )
		

		-- 던전 코어
		respawn_guardian( 123000, 0, 180000, 201148, 139760, 8180002, 1,  0 )
		respawn_guardian( 123000, 0, 180000, 201229, 139835, 8180002, 1,  0 )
		respawn_guardian( 123000, 0, 180000, 201148, 139908, 8180002, 1,  0 )
		respawn_guardian( 123000, 0, 180000, 201064, 139836, 8180002, 1,  0 )			
		
	-- 엘 카시아
-- <가디언을 소환하는 함수>
-- respawn_guardian( dungeon_id, id, interval, x, y, mob_id, count, is_wandering )
-- id는 여전히 쓰레기 값이니 -1을 넣어주시면 됩니다. 나머지는 이전 함수와 동일합니다.


-- <혼유석, 규인화 소환하는 함수>
-- 던전시즈 중에 코어 소유권에 따른 피아식별 가능하다.
-- 레이드때에도 등장하며, 레이드 중에 죽으면 리젠 되지 않는다.
-- 일반 던전의 배치도 이 함수를 사용하여 한다.
-- respawn_environmental_guardian( dungeon_id, id, interval, x, y, mob_id, count, is_wandering )
-- id 는 해당 혼유석, 규인화가 속해있는 던전코어 및 제어장치의 id를 입력하면 된다.
-- 0 : 던전코어
-- 1 : 제어장치 1번
-- 2 : 제어장치 2번 등 순서대로 제어장치의 순서 id를 입력하면 된다. 
-- id가 코어나 제어장치에 아무것도 해당되지 않는 값이 입력되어 있다면 처음부터 끝까지 던전 방어자 길드를 지키게 된다.

	
				-- 제어장치1
		respawn_guardian( 120700, 1, 180000, 204639, 117719, 8200003, 1,  0 )
		respawn_guardian( 120700, 1, 180000, 204502, 117726, 8200003, 1,  0 )
		respawn_guardian( 120700, 1, 180000, 204510, 117845, 8200003, 1,  0 )
		respawn_guardian( 120700, 1, 180000, 204629, 117837, 8200003, 1,  0 )
		
		-- 제어장치2
		respawn_guardian( 120700, 2, 180000, 207732, 118783, 8200003, 1,  0 )
		respawn_guardian( 120700, 2, 180000, 207834, 118725, 8200003, 1,  0 )
		respawn_guardian( 120700, 2, 180000, 207779, 118622, 8200003, 1,  0 )
		respawn_guardian( 120700, 2, 180000, 207672, 118680, 8200003, 1,  0 )
		

		-- 던전 코어
		respawn_guardian( 120700, 0, 180000, 206115, 120120, 8200003, 1,  0 )
		respawn_guardian( 120700, 0, 180000, 206020, 120143, 8200003, 1,  0 )
		respawn_guardian( 120700, 0, 180000, 206012, 120249, 8200003, 1,  0 )
		respawn_guardian( 120700, 0, 180000, 206158, 120239, 8200003, 1,  0 )			
		
		
		-- 혼유석 (던전코어 소속)
				
		respawn_environmental_guardian( 120700, 0, 12000, 206076, 117959, 130007, 1, 0 )		
		respawn_environmental_guardian( 120700, 0, 12000, 205710, 119169, 130007, 1, 0 )		
		respawn_environmental_guardian( 120700, 0, 12000, 206443, 119169, 130007, 1, 0 )		
		
		--숨겨진 던전용 엘카시아
		-- 혼유석 (숨겨진 던전용)
		respawn_environmental_guardian( 110100, 0, 12000, 189582, 22402, 130007, 1, 0 )		
		respawn_environmental_guardian( 110100, 0, 12000, 190316, 22399, 130007, 1, 0 )		
		respawn_environmental_guardian( 110100, 0, 12000, 189946, 21192, 130007, 1, 0 )

				
		-- 규인화 배치 (2층 복도) 던전코어 소속
		respawn_environmental_guardian( 120700, 0, 12000, 205426, 117450, 140003, 1, 0 )
		respawn_environmental_guardian( 120700, 0, 12000, 205250, 117855, 140003, 1, 0 )
		respawn_environmental_guardian( 120700, 0, 12000, 205165, 118249, 140003, 1, 0 )
		respawn_environmental_guardian( 120700, 0, 12000, 205093, 118836, 140003, 1, 0 )
		respawn_environmental_guardian( 120700, 0, 12000, 205205, 119592, 140003, 1, 0 )
		respawn_environmental_guardian( 120700, 0, 12000, 205255, 119941, 140003, 1, 0 )
		respawn_environmental_guardian( 120700, 0, 12000, 205483, 120269, 140003, 1, 0 )
		respawn_environmental_guardian( 120700, 0, 12000, 206737, 117439, 140003, 1, 0 )
		respawn_environmental_guardian( 120700, 0, 12000, 206919, 117862, 140003, 1, 0 )
		respawn_environmental_guardian( 120700, 0, 12000, 206976, 118179, 140003, 1, 0 )		
		respawn_environmental_guardian( 120700, 0, 12000, 207033, 118887, 140003, 1, 0 )		
		respawn_environmental_guardian( 120700, 0, 12000, 206928, 119483, 140003, 1, 0 )				
		respawn_environmental_guardian( 120700, 0, 12000, 206798, 119859, 140003, 1, 0 )
		respawn_environmental_guardian( 120700, 0, 12000, 206577, 120309, 140003, 1, 0 )

		--숨겨진 던전용 엘카시아
		-- 규인화 배치 (2층 복도) (숨겨진 던전용)
		respawn_environmental_guardian( 110100, 0, 12000, 189497, 20464, 140003, 1, 0 )
		respawn_environmental_guardian( 110100, 0, 12000, 189282, 20731, 140003, 1, 0 )
		respawn_environmental_guardian( 110100, 0, 12000, 189116, 21124, 140003, 1, 0 )
		respawn_environmental_guardian( 110100, 0, 12000, 189048, 21671, 140003, 1, 0 )
		respawn_environmental_guardian( 110100, 0, 12000, 188969, 22187, 140003, 1, 0 )
		respawn_environmental_guardian( 110100, 0, 12000, 189158, 22857, 140003, 1, 0 )
		respawn_environmental_guardian( 110100, 0, 12000, 189423, 23487, 140003, 1, 0 )
		respawn_environmental_guardian( 110100, 0, 12000, 190461, 23388, 140003, 1, 0 )
		respawn_environmental_guardian( 110100, 0, 12000, 190739, 22855, 140003, 1, 0 )
		respawn_environmental_guardian( 110100, 0, 12000, 190926, 22250, 140003, 1, 0 )		
		respawn_environmental_guardian( 110100, 0, 12000, 190836, 21486, 140003, 1, 0 )		
		respawn_environmental_guardian( 110100, 0, 12000, 190761, 21082, 140003, 1, 0 )				
		respawn_environmental_guardian( 110100, 0, 12000, 190569, 20680, 140003, 1, 0 )
		respawn_environmental_guardian( 110100, 0, 12000, 190309, 20372, 140003, 1, 0 )
		
		
		-- 엘카시아 독벽장 감 에 작은 규인화 배치 (제어장치 1 소속)
		respawn_environmental_guardian( 120700, 1, 12000, 204541, 117707, 140004, 1, 0 )
		

		-- 엘카시아 수벽장 간 에 작은 규인화 배치 (던전코어 소속)
		respawn_environmental_guardian( 120700, 0, 12000, 204299, 118984, 140004, 1, 0 )
		

		-- 엘카시아 독벽장 이 에 작은 규인화 배치 (제어장치 2 소속)
		respawn_environmental_guardian( 120700, 2, 12000, 207815, 118757, 140004, 1, 0 )
		
		
		-- 엘카시아 금벽장 곤 에 작은 규인화 배치 (던전코어 소속)
		respawn_environmental_guardian( 120700, 0, 12000, 207556, 117317, 140004, 1, 0 )
		
		--숨겨진 던전용 엘카시아
		-- 엘카시아 독벽장 감 에 작은 규인화 배치 (숨겨진 던전용)
		respawn_environmental_guardian( 110100, 1, 12000, 188360, 21059, 140004, 1, 0 )
		

		-- 엘카시아 수벽장 간 에 작은 규인화 배치 (던전코어 소속)
		respawn_environmental_guardian( 110100, 0, 12000, 188324, 22230, 140004, 1, 0 )
		

		-- 엘카시아 독벽장 이 에 작은 규인화 배치 (제어장치 2 소속)
		respawn_environmental_guardian( 110100, 2, 12000, 191280, 20435, 140004, 1, 0 )
		
		
		-- 엘카시아 금벽장 곤 에 작은 규인화 배치 (던전코어 소속)
		respawn_environmental_guardian( 110100, 0, 12000, 191559, 22000, 140004, 1, 0 )
	
		
		
end
